nam348tnh3gp/ESP32-Lottery/ESP_Code.ino
    <div class='btn-group'>
        <button onclick='toggleConfig()'>⚙️ Configure</button>
        <button onclick='switchPool()'>🔄 Switch Pool</button>
        <button onclick='restartMiner()'>🔁 Restart</button>
        <button onclick='resetWiFi()'>📡 Reset WiFi</button>
    </div>
    
    <div id='configPanel' class='config-panel card'>
        <h3>Miner Configuration</h3>
        <label>Pool Host:</label>
        <input type='text' id='poolHost' placeholder='public-pool.io' value='public-pool.io'>
        
        <label>Port:</label>
        <select id='poolPort'>
            <option value='3333'>3333 (TCP)</option>
            <option value='4333'>4333 (TLS/SSL)</option>
        </select>
        
        <label>BTC Address:</label>
        <input type='text' id='btcAddr' placeholder='1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa' style='width:100%;'>
        
        <label>Worker Name:</label>
        <input type='text' id='walletName' placeholder='ESP32' value='ESP32'>
        
        <button onclick='saveConfig()'>💾 Save & Restart</button>
    </div>

    <script>
        let coreCount = 1;
        
        function toggleConfig() {
            var p = document.getElementById('configPanel');
            p.style.display = p.style.display == 'block' ? 'none' : 'block';
        }
        
        function copyIP() {
            var ip = document.getElementById('ipAddress').innerText;
            navigator.clipboard.writeText(ip);
            alert('IP Copied: ' + ip);
        }
        
        function saveConfig() {
            var data = {
                poolHost: document.getElementById('poolHost').value,
                poolPort: parseInt(document.getElementById('poolPort').value),
                btcAddr: document.getElementById('btcAddr').value,
                wallet: document.getElementById('walletName').value
            };
            fetch('/api/config', {
                method: 'POST',
                headers: {'Content-Type': 'application/json'},
                body: JSON.stringify(data)
            }).then(r => r.json()).then(d => {
                alert('Saved! Restarting miner...');
                setTimeout(() => location.reload(), 2000);
            });
        }
        
        function switchPool() {
            if(confirm('Switch to next backup pool?')) {
                fetch('/api/switchpool')
                    .then(r => r.json())
                    .then(d => {
                        alert('Switched to: ' + d.pool);
                        setTimeout(() => location.reload(), 2000);
                    });
            }
        }
        
        function restartMiner() {
            if(confirm('Restart miner?')) {
                fetch('/api/restart');
                setTimeout(() => location.reload(), 3000);
            }
        }
        
        function resetWiFi() {
            if(confirm('Reset WiFi settings? Device will reboot to AP mode.')) {
                fetch('/api/resetwifi');
            }
        }
        
        function updateCoreStats(data) {
            let container = document.getElementById('coreStatsContainer');
            if (data.coreCount != coreCount) {
                coreCount = data.coreCount;
                let html = '<div class="card"><span class="label">💻 CPU Cores:</span> ' + coreCount + '</div>';
                if (coreCount == 2) {
                    html += '<div style="display:flex; gap:10px;">' +
                        '<div class="card" style="flex:1; background:#0f3460; text-align:center;">' +
                            '<span class="label">Core 0</span>' +
                            '<div id="hashrate0" style="font-size:1.5em;color:#0f0;">0.00 H/s</div>' +
                        '</div>' +
                        '<div class="card" style="flex:1; background:#0f3460; text-align:center;">' +
                            '<span class="label">Core 1</span>' +
                            '<div id="hashrate1" style="font-size:1.5em;color:#0f0;">0.00 H/s</div>' +
                        '</div>' +
                    '</div>';
                }
                container.innerHTML = html;
            }
            if (coreCount == 2) {
                document.getElementById('hashrate0').innerHTML = data.hashrate0 + ' H/s';
                document.getElementById('hashrate1').innerHTML = data.hashrate1 + ' H/s';
            }
        }
        
        function fetchStats() {
            fetch('/api/stats').then(r => r.json()).then(d => {
                document.getElementById('status').innerHTML = d.status;
                document.getElementById('hashrate').innerHTML = d.hashrate + ' H/s';
                document.getElementById('totalHashes').innerHTML = d.totalHashes;
                document.getElementById('nonce').innerHTML = d.nonceStart + ' - ' + d.nonceEnd;
                document.getElementById('poolInfo').innerHTML = d.pool;
                document.getElementById('backupPools').innerHTML = d.backupPools;
                document.getElementById('btcInfo').innerHTML = d.btcAddress || 'Not set';
                document.getElementById('workerInfo').innerHTML = d.worker;
                document.getElementById('ipAddress').innerHTML = d.ip;
                document.getElementById('chipBadge').innerHTML = d.chip + ' (' + d.coreCount + ' cores)';
                document.getElementById('poolHost').value = d.poolHost;
                document.getElementById('poolPort').value = d.poolPort;
                document.getElementById('btcAddr').value = d.btcAddress;
                document.getElementById('walletName').value = d.wallet;
                updateCoreStats(d);
            });
        }
        
        setInterval(fetchStats, 2000);
        fetchStats();
    </script>
</body>
</html>
)rawliteral";
#endif // DISABLE_WEB_DASHBOARD

// ==================== PLATFORM-SPECIFIC UTILS ====================
#ifdef ESP8266
void loadConfig() {
    EEPROM.begin(sizeof(Config));
    EEPROM.get(0, config);
    EEPROM.end();
    poolHost = String(config.poolHost);
    poolPort = config.poolPort;
    btcAddress = String(config.btcAddress);
    walletName = String(config.walletName);
}

