nam348tnh3gp/ESP32-Lottery/ESP_Code.ino
                    const char* nbitsHex = params[6];
                    hexToBytes(nbitsHex, header + 72, 4);
                    reverseBytes(header + 72, 4);
                    
                    const char* ntimeHex = params[7];
                    hexToBytes(ntimeHex, header + 68, 4);
                    reverseBytes(header + 68, 4);
                    
                    uint32_t bits;
                    memcpy(&bits, header + 72, 4);
                    bits = __builtin_bswap32(bits);
                    
                    uint32_t exp = bits >> 24;
                    uint32_t mant = bits & 0x00FFFFFF;
                    memset(target, 0, 32);
                    if (exp <= 32) {
                        target[31 - exp] = (mant >> 16) & 0xFF;
                        target[30 - exp] = (mant >> 8) & 0xFF;
                        target[29 - exp] = mant & 0xFF;
                    }
                    
                    solutionFound = false;
                    shouldStopMining = false;
                    nonceStart = 0;
                    hashesCore0 = 0;
                    hashesCore1 = 0;
                    
                    jobReceived = true;
                    miningActive = true;
                    lastJobTime = millis();
                    Serial.println("📦 New job #" + jobId + " from " + poolHost);
                }
                
                int id = doc["id"];
                if (id == 1) {
                    stratumAuthorize();
                }
                if (id == 2) {
                    bool success = doc["result"];
                    if (!success) {
                        Serial.println("❌ Auth failed on " + poolHost);
                        switchToNextPool();
                        stratumWS.disconnect();
                        delay(3000);
                        stratumConnect();
                    } else {
                        Serial.println("🔑 Authorized on " + poolHost);
                    }
                }
                if (id == 4) {
                    bool accepted = doc["result"];
                    if (accepted) {
                        Serial.println("✅ Share accepted by " + poolHost);
                    } else {
                        Serial.println("❌ Share rejected by " + poolHost);
                    }
                }
            }
            break;
            
        case WStype_ERROR:
            Serial.println("❌ WebSocket error on " + poolHost);
            break;
    }
}

// ==================== STRATUM CONNECT (definition) ====================
void stratumConnect() {
    if (!btcAddress.isEmpty()) {
        bool useSSL = (poolPort == 4333 || poolPort == 4334 || poolPort == 443);
        
        Serial.printf("🔌 Connecting to %s:%d (%s)...\n", 
                     poolHost.c_str(), poolPort, useSSL ? "WSS" : "WS");
        
        if (useSSL) {
            stratumWS.beginSSL(poolHost.c_str(), poolPort, "/");
        } else {
            stratumWS.begin(poolHost.c_str(), poolPort, "/");
        }
        
        stratumWS.onEvent(stratumEvent);
        stratumWS.setReconnectInterval(10000);
    }
}

// ==================== WEB SERVER ====================
#ifndef DISABLE_WEB_DASHBOARD
void setupWebServer() {
    webServer.on("/", HTTP_GET, [](AsyncWebServerRequest *req) {
        req->send_P(200, "text/html", dashboard_html);
    });
    
    webServer.on("/api/stats", HTTP_GET, [](AsyncWebServerRequest *req) {
        StaticJsonDocument<1024> doc;
        
        if (!miningActive) {
            doc["status"] = "🔴 Disconnected";
        } else if (!jobReceived) {
            doc["status"] = "🟡 Waiting job";
        } else if (solutionFound) {
            doc["status"] = "🏆 Solution found!";
        } else {
            doc["status"] = "🟢 Mining";
        }
        
        float hr0 = hashesCore0 / 2.0f;
        float hr1 = hashesCore1 / 2.0f;
        
        doc["hashrate"] = String(hr0 + hr1, 2);
        doc["hashrate0"] = String(hr0, 2);
        doc["hashrate1"] = String(hr1, 2);
        doc["totalHashes"] = String(hashesCore0 + hashesCore1);
        doc["nonceStart"] = "0x" + String(nonceStart, HEX);
        doc["nonceEnd"] = "0x" + String(nonceStart + 0x00FFFFFF, HEX);
        doc["coreCount"] = CORE_COUNT;
        doc["chip"] = PLATFORM_NAME;
        
        bool currentIsSSL = (poolPort == 4333);
        doc["pool"] = poolHost + ":" + String(poolPort) + 
                     (currentIsSSL ? " <span class='tls-badge'>🔒 TLS</span>" : " <span class='pool-badge'>🔓 TCP</span>");
        doc["btcAddress"] = btcAddress;
        doc["worker"] = btcAddress.isEmpty() ? "-" : (btcAddress + "." + walletName);
        doc["poolHost"] = poolHost;
        doc["poolPort"] = poolPort;
        doc["wallet"] = walletName;
        doc["ip"] = currentIP;
        doc["version"] = MINER_VERSION;
        
        String backupList = "";
        for (int i = 0; i < NUM_BACKUP_POOLS; i++) {
            if (i > 0) backupList += " → ";
            if (i == currentPoolIndex) {
                backupList += "<span class='pool-badge'>ACTIVE</span> ";
            }
            backupList += String(backupPools[i]) + ":" + String(backupPorts[i]);
            backupList += backupUseSSL[i] ? " <span class='tls-badge'>🔒</span>" : " 🔓";
        }
        doc["backupPools"] = backupList;
        
        String json;
        serializeJson(doc, json);
        req->send(200, "application/json", json);
    });
    
    webServer.on("/api/config", HTTP_POST, [](AsyncWebServerRequest *req) {}, NULL,
        [](AsyncWebServerRequest *req, uint8_t *data, size_t len, size_t index, size_t total) {
            StaticJsonDocument<256> doc;
            DeserializationError err = deserializeJson(doc, data, len);
            if (!err) {
                poolHost = doc["poolHost"].as<String>();
                poolPort = doc["poolPort"].as<uint16_t>();
                btcAddress = doc["btcAddr"].as<String>();
                walletName = doc["wallet"].as<String>();
                
                if (poolHost.isEmpty()) poolHost = "public-pool.io";
                if (poolPort == 0) poolPort = 3333;
                
#ifdef ESP32
                prefs.begin(PREF_NAMESPACE, false);
                prefs.putString(PREF_POOL_HOST, poolHost);
                prefs.putUShort(PREF_POOL_PORT, poolPort);
                prefs.putString(PREF_BTC_ADDR, btcAddress);
                prefs.putString(PREF_WALLET, walletName);
                prefs.end();
#else
                saveConfigEEPROM();
#endif
                
                req->send(200, "application/json", "{\"ok\":true}");
                delay(500);
                ESP.restart();
            } else {
                req->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            }
        });
    
    webServer.on("/api/switchpool", HTTP_GET, [](AsyncWebServerRequest *req) {
        switchToNextPool();
        
        StaticJsonDocument<128> doc;
        doc["ok"] = true;
        doc["pool"] = poolHost + ":" + String(poolPort);
        
        String json;
        serializeJson(doc, json);
        req->send(200, "application/json", json);
        
        shouldStopMining = true;
        stratumWS.disconnect();
        delay(2000);
        stratumConnect();
    });
    
    webServer.on("/api/restart", HTTP_GET, [](AsyncWebServerRequest *req) {
        req->send(200, "application/json", "{\"ok\":true}");
        delay(500);
        ESP.restart();
    });
    
