nam348tnh3gp/ESP32-Lottery/ESP_Code.ino
    webServer.on("/api/resetwifi", HTTP_GET, [](AsyncWebServerRequest *req) {
        req->send(200, "application/json", "{\"ok\":true}");
        WiFiManager wm;
        wm.resetSettings();
        delay(500);
        ESP.restart();
    });
    
    webServer.begin();
}
#endif // DISABLE_WEB_DASHBOARD

// ==================== SETUP ====================
void setup() {
    Serial.begin(115200);
    delay(1000);
    
    Serial.println("\n\n╔══════════════════════════════════════════╗");
    Serial.println("║   🎰 ESP Lottery Miner v" + String(MINER_VERSION) + "           ║");
    Serial.println("║   Platform: " + String(PLATFORM_NAME));
    Serial.print("║   Cores: " + String(CORE_COUNT) + " (");
    Serial.print(CORE_COUNT == 2 ? "Dual" : "Single");
    Serial.println("-core)            ║");
    Serial.println("╚══════════════════════════════════════════╝\n");
    
    watchdogSetup();
    
    submitMutex = xSemaphoreCreateMutex();
    
    loadConfig();
    
    for (int i = 0; i < NUM_BACKUP_POOLS; i++) {
        if (poolHost == backupPools[i] && poolPort == backupPorts[i]) {
            currentPoolIndex = i;
            break;
        }
    }
    
    Serial.printf("📋 Config - Pool: %s:%d (%s)\n", 
                 poolHost.c_str(), poolPort, 
                 (poolPort == 4333) ? "TLS" : "TCP");
    Serial.printf("💳 BTC: %s\n", btcAddress.isEmpty() ? "Not set" : btcAddress.c_str());
    Serial.printf("👤 Worker: %s\n", btcAddress.isEmpty() ? "-" : (btcAddress + "." + walletName).c_str());
    
    WiFiManager wm;
    wm.setConfigPortalTimeout(180);
    
    if (!wm.autoConnect("ESP-Miner-Setup")) {
        Serial.println("Failed to connect, restarting...");
        delay(3000);
        ESP.restart();
    }
    
    WiFi.setSleep(false);
    currentIP = WiFi.localIP().toString();
    
    Serial.println("\n✅ WiFi connected!");
    Serial.println("🌐 IP: " + currentIP);
    Serial.println("📶 RSSI: " + String(WiFi.RSSI()) + " dBm");
    
    if (MDNS.begin(MDNS_NAME)) {
        MDNS.addService("http", "tcp", 80);
        Serial.println("📡 mDNS: http://" + String(MDNS_NAME) + ".local");
    }
    
#ifndef DISABLE_WEB_DASHBOARD
    setupWebServer();
#else
    Serial.println("⚠️ Web Dashboard disabled (Lite mode)");
#endif
    
    // Create mining tasks
#if CORE_COUNT == 2
    xTaskCreatePinnedToCore(miningTask, "MiningTask0", 10240, (void*)0, 1, &miningTask0, 0);
    xTaskCreatePinnedToCore(miningTask, "MiningTask1", 10240, (void*)1, 1, &miningTask1, 1);
    Serial.println("⚡ Dual-core mining (10KB stack each)");
#else
    xTaskCreate(miningTask, "MiningTask", 8192, (void*)0, 1, &miningTask0);
    Serial.println("⚡ Single-core mining (8KB stack)");
#endif
    
    Serial.println("\n================================================");
#ifndef DISABLE_WEB_DASHBOARD
    Serial.println("🔧 Dashboard: http://" + currentIP);
#endif
    Serial.println("🔄 Auto pool failover: ENABLED (4 pools)");
    Serial.println("🔒 TLS: " + String(poolPort == 4333 ? "ENABLED" : "DISABLED"));
    Serial.println("🛡️ WDT: " + String(WDT_TIMEOUT) + "s");
    Serial.println("================================================\n");
    
    if (!btcAddress.isEmpty()) {
        stratumConnect();
    } else {
        Serial.println("⚠️ BTC Address not set. Configure at: http://" + currentIP);
    }
}

// ==================== LOOP ====================
void loop() {
    watchdogReset();
    stratumWS.loop();
    
    if (solutionFound) {
        stratumSubmit(nonceFound);
        solutionFound = false;
        jobReceived = false;
        shouldStopMining = true;
    }
    
    if (millis() - lastReport > 2000) {
        float hr0 = hashesCore0 / 2.0f;
        float hr1 = hashesCore1 / 2.0f;
        currentHashrate = hr0 + hr1;
        
        if (miningActive && jobReceived) {
            Serial.printf("⚡ %.2f H/s (C0: %.2f, C1: %.2f) | Nonce: 0x%08X | %s\n", 
                         currentHashrate, hr0, hr1, nonceStart, poolHost.c_str());
        }
        
        lastReport = millis();
        hashesCore0 = 0;
        hashesCore1 = 0;
        nonceStart += 0x01000000;
        
        if (nonceStart > 0xFF000000) {
            nonceStart = 0;
        }
    }
    
    if (jobReceived && (millis() - lastJobTime > 60000)) {
        jobReceived = false;
        miningActive = false;
        shouldStopMining = true;
        Serial.println("⏰ Job stale, reconnecting...");
        stratumWS.disconnect();
        delay(5000);
        stratumConnect();
    }
    
    if (!stratumWS.isConnected() && !btcAddress.isEmpty() && WiFi.isConnected()) {
        if (millis() - lastReconnectAttempt > 10000) {
            lastReconnectAttempt = millis();
            Serial.println("🔄 Reconnecting...");
            stratumConnect();
        }
    }
    
    delay(10);
}
